{
  "clerkAuth": {
    "loginSuccess": {
      "action": "متابعة الجلسة",
      "desc": "{{greeting}}، من الرائع مواصلة خدمتك. دعنا نستأنف من حيث توقفنا.",
      "title": "أهلًا بعودتك، {{nickName}}"
    }
  },
  "error": {
    "backHome": "العودة إلى الصفحة الرئيسية",
    "desc": "حاول مرة أخرى لاحقًا، أو عد إلى العالم المعروف.",
    "retry": "إعادة التحميل",
    "title": "عفوًا، حدث خطأ ما.."
  },
  "fetchError": {
    "detail": "تفاصيل الخطأ",
    "title": "فشل الطلب"
  },
  "import": {
    "importConfigFile": {
      "description": "سبب الخطأ: {{reason}}",
      "title": "فشل الاستيراد"
    },
    "incompatible": {
      "description": "تم تصدير هذا الملف من إصدار أحدث. يرجى محاولة الترقية إلى أحدث إصدار ثم إعادة الاستيراد.",
      "title": "التطبيق الحالي لا يدعم استيراد هذا الملف"
    }
  },
  "loginRequired": {
    "desc": "سيتم إعادة توجيهك إلى صفحة تسجيل الدخول قريبًا",
    "title": "يرجى تسجيل الدخول لاستخدام هذه الميزة"
  },
  "notFound": {
    "backHome": "العودة إلى الصفحة الرئيسية",
    "check": "يرجى التحقق من صحة عنوان URL الخاص بك.",
    "desc": "لم نتمكن من العثور على الصفحة التي تبحث عنها.",
    "title": "دخلت منطقة غير معروفة؟"
  },
  "pluginSettings": {
    "desc": "أكمل الإعدادات التالية لبدء استخدام هذا البرنامج المساعد",
    "title": "إعدادات البرنامج المساعد {{name}}"
  },
  "response": {
    "400": "أنا آسف، الخادم لا يفهم طلبك. يرجى التأكد من صحة معلمات طلبك.",
    "401": "أنا آسف، الخادم رفض طلبك، ربما بسبب عدم كفاية الأذونات أو مصادقة غير صالحة.",
    "403": "أنا آسف، الخادم رفض طلبك. ليس لديك إذن للوصول إلى هذا المحتوى.",
    "404": "أنا آسف، الخادم لا يستطيع العثور على الصفحة أو المورد الذي طلبته. يرجى التأكد من صحة عنوان URL الخاص بك.",
    "405": "أنا آسف، الخادم لا يدعم أسلوب الطلب الذي تستخدمه. يرجى التأكد من صحة أسلوب طلبك.",
    "406": "أنا آسف، الخادم لا يمكنه إكمال الطلب بناءً على خصائص المحتوى الذي طلبته",
    "407": "أنا آسف، تحتاج إلى مصادقة الوكيل قبل المتابعة مع هذا الطلب",
    "408": "أنا آسف، انتهى وقت الخادم أثناء انتظار الطلب، يرجى التحقق من اتصال الشبكة لديك وحاول مرة أخرى",
    "409": "أنا آسف، لا يمكن معالجة الطلب بسبب تعارض، ربما لأن حالة المورد غير متوافقة مع الطلب",
    "410": "أنا آسف، تم إزالة المورد الذي طلبته بشكل دائم ولا يمكن العثور عليه",
    "411": "أنا آسف، الخادم لا يمكنه معالجة الطلب بدون طول محتوى صالح",
    "412": "أنا آسف، طلبك لا يلبي شروط الخادم ولا يمكن إكماله",
    "413": "أنا آسف، بيانات طلبك كبيرة جدًا بالنسبة للخادم لمعالجتها",
    "414": "أنا آسف، عنوان URI لطلبك طويل جدًا بالنسبة للخادم لمعالجته",
    "415": "أنا آسف، الخادم لا يمكنه معالجة تنسيق الوسائط المرفق بالطلب",
    "416": "أنا آسف، الخادم لا يمكنه تلبية نطاق طلبك",
    "417": "أنا آسف، الخادم لا يمكنه تلبية توقعاتك",
    "422": "أنا آسف، طلبك بتنسيق صحيح، ولكن نظرًا لأخطاء دلالية، لا يمكن الرد عليه",
    "423": "أنا آسف، المورد الذي طلبته مقفل",
    "424": "أنا آسف، لا يمكن إكمال الطلب الحالي بسبب فشل طلب سابق",
    "426": "أنا آسف، الخادم يتطلب من عميلك الترقية إلى إصدار بروتوكول أعلى",
    "428": "أنا آسف، الخادم يتطلب شرطًا مسبقًا، ويطلب أن يحتوي طلبك على الرأس الشرطي الصحيح",
    "429": "أنا آسف، طلبك متكرر جدًا والخادم متعب بعض الشيء. يرجى المحاولة مرة أخرى لاحقًا.",
    "431": "أنا آسف، حقول الرأس في طلبك كبيرة جدًا بالنسبة للخادم لمعالجتها",
    "451": "أنا آسف، الخادم يرفض تقديم هذا المورد لأسباب قانونية",
    "499": "نعتذر، تم مقاطعة طلبك بشكل غير متوقع أثناء معالجته بواسطة الخادم، ربما بسبب إلغائك للعملية أو اتصال شبكة غير مستقر. يرجى التحقق من حالة الشبكة لديك وحاول مرة أخرى.",
    "500": "أنا آسف، يبدو أن الخادم يواجه بعض الصعوبات وهو غير قادر مؤقتًا على إكمال طلبك. يرجى المحاولة مرة أخرى لاحقًا.",
    "501": "أنا آسف، الخادم لا يعرف كيفية التعامل مع هذا الطلب حتى الآن. يرجى التأكد من صحة عمليتك.",
    "502": "أنا آسف، يبدو أن الخادم ضائع وهو غير قادر مؤقتًا على تقديم الخدمة. يرجى المحاولة مرة أخرى لاحقًا.",
    "503": "أنا آسف، الخادم غير قادر حاليًا على معالجة طلبك، ربما بسبب زيادة التحميل أو الصيانة. يرجى المحاولة مرة أخرى لاحقًا.",
    "504": "أنا آسف، الخادم لم يتلق ردًا من الخادم الرئيسي. يرجى المحاولة مرة أخرى لاحقًا.",
    "505": "أنا آسف، الخادم لا يدعم إصدار HTTP الذي تستخدمه. يرجى التحديث والمحاولة مرة أخرى.",
    "506": "أنا آسف، هناك مشكلة في تكوين الخادم. يرجى الاتصال بالمسؤول لحل المشكلة.",
    "507": "أنا آسف، مساحة التخزين في الخادم غير كافية لمعالجة طلبك. يرجى المحاولة مرة أخرى لاحقًا.",
    "509": "أنا آسف، تم استنفاد عرض نطاق الخادم. يرجى المحاولة مرة أخرى لاحقًا.",
    "510": "أنا آسف، الخادم لا يدعم الملحق المطلوب. يرجى الاتصال بالمسؤول.",
    "520": "نعتذر، واجه الخادم مشكلة غير متوقعة حالت دون إكمال طلبك. يرجى المحاولة مرة أخرى لاحقًا؛ نحن نعمل على حل هذه المشكلة.",
    "522": "نعتذر، انتهى وقت اتصال الخادم ولم يتمكن من الرد على طلبك في الوقت المناسب. قد يكون هذا بسبب شبكة غير مستقرة أو عدم إمكانية الوصول إلى الخادم مؤقتًا. يرجى المحاولة مرة أخرى لاحقًا؛ نحن نعمل على استعادة الخدمة.",
    "524": "نعتذر، انتهى وقت الخادم أثناء انتظار الرد، ربما بسبب بطء الرد. يرجى المحاولة مرة أخرى لاحقًا.",
    "AgentRuntimeError": "خطأ في تشغيل نموذج لغة Lobe. يرجى استكشاف الأخطاء وإصلاحها أو إعادة المحاولة بناءً على المعلومات التالية.",
    "ConnectionCheckFailed": "الطلب أعاد قيمة فارغة. يرجى التحقق من أن عنوان وكيل واجهة برمجة التطبيقات لا ينتهي بـ `/v1`.",
    "CreateMessageError": "أنا آسف، لم يتم إرسال الرسالة بنجاح. يرجى نسخ المحتوى ومحاولة إرساله مرة أخرى. لن يتم الاحتفاظ بهذه الرسالة بعد تحديث الصفحة.",
    "ExceededContextWindow": "محتوى الطلب الحالي يتجاوز الطول الذي يمكن للنموذج معالجته. يرجى تقليل كمية المحتوى وحاول مرة أخرى.",
    "FreePlanLimit": "أنت مستخدم مجاني حاليًا ولا يمكنك استخدام هذه الميزة. يرجى الترقية إلى خطة مدفوعة لمواصلة استخدامها.",
    "InsufficientQuota": "أنا آسف، تم الوصول إلى حصة هذا المفتاح. يرجى التحقق من رصيد حسابك أو زيادة حصة المفتاح وحاول مرة أخرى.",
    "InvalidAccessCode": "رمز الوصول غير صالح أو فارغ. يرجى إدخال رمز الوصول الصحيح أو إضافة مفتاح واجهة برمجة تطبيقات مخصص.",
    "InvalidBedrockCredentials": "فشلت مصادقة Bedrock. يرجى التحقق من AccessKeyId/SecretAccessKey وإعادة المحاولة.",
    "InvalidClerkUser": "أنا آسف، أنت غير مسجل الدخول حاليًا. يرجى تسجيل الدخول أو إنشاء حساب للمتابعة.",
    "InvalidGithubToken": "رمز الوصول الشخصي لـ GitHub غير صحيح أو فارغ. يرجى التحقق من رمز الوصول الشخصي لـ GitHub الخاص بك وحاول مرة أخرى.",
    "InvalidOllamaArgs": "تكوين Ollama غير صالح، يرجى التحقق من تكوين Ollama وحاول مرة أخرى",
    "InvalidProviderAPIKey": "مفتاح واجهة برمجة التطبيقات {{provider}} غير صحيح أو فارغ، يرجى التحقق من مفتاح واجهة برمجة التطبيقات {{provider}} الخاص بك وحاول مرة أخرى",
    "InvalidVertexCredentials": "فشلت مصادقة Vertex. يرجى التحقق من بيانات الاعتماد الخاصة بك وحاول مرة أخرى.",
    "LocationNotSupportError": "نعتذر، موقعك الحالي لا يدعم خدمة نموذج هذا. قد يكون هذا بسبب القيود الإقليمية أو عدم توفر الخدمة. يرجى التأكد من أن الموقع الحالي يدعم استخدام هذه الخدمة، أو حاول استخدام موقع مختلف.",
    "ModelNotFound": "أنا آسف، لم يتم العثور على النموذج المطلوب. قد لا يكون موجودًا أو قد لا تملك أذونات الوصول اللازمة. يرجى المحاولة مرة أخرى بعد تغيير مفتاح واجهة برمجة التطبيقات أو ضبط أذونات الوصول الخاصة بك.",
    "NoOpenAIAPIKey": "مفتاح واجهة برمجة تطبيقات OpenAI فارغ، يرجى إضافة مفتاح واجهة برمجة تطبيقات OpenAI مخصص",
    "OllamaBizError": "خطأ في طلب خدمة Ollama، يرجى استكشاف الأخطاء وإصلاحها أو إعادة المحاولة بناءً على المعلومات التالية",
    "OllamaServiceUnavailable": "خدمة Ollama غير متوفرة. يرجى التحقق من تشغيل Ollama بشكل صحيح أو من ضبط تكوين المنشأ المتقاطع لـ Ollama بشكل صحيح.",
    "PermissionDenied": "أنا آسف، ليس لديك إذن للوصول إلى هذه الخدمة. يرجى التحقق مما إذا كان مفتاحك يحتوي على حقوق الوصول اللازمة.",
    "PluginApiNotFound": "أنا آسف، واجهة برمجة التطبيقات غير موجودة في بيان البرنامج المساعد. يرجى التحقق مما إذا كانت طريقة طلبك تتطابق مع واجهة برمجة تطبيقات بيان البرنامج المساعد",
    "PluginApiParamsError": "أنا آسف، فشل التحقق من صحة معلمة الإدخال لطلب البرنامج المساعد. يرجى التحقق مما إذا كانت معلمات الإدخال تتطابق مع وصف واجهة برمجة التطبيقات",
    "PluginFailToTransformArguments": "أنا آسف، فشل البرنامج المساعد في تحليل الوسائط. يرجى محاولة إعادة إنشاء رسالة المساعد أو التبديل إلى نموذج AI أكثر قوة مع إمكانية استدعاء الأدوات وحاول مرة أخرى",
    "PluginGatewayError": "أنا آسف، حدث خطأ في بوابة البرنامج المساعد. يرجى التحقق من صحة تكوين بوابة البرنامج المساعد.",
    "PluginManifestInvalid": "أنا آسف، فشل التحقق من صحة بيان البرنامج المساعد. يرجى التحقق من صحة تنسيق البيان",
    "PluginManifestNotFound": "أنا آسف، لم يتمكن الخادم من العثور على ملف بيان البرنامج المساعد (manifest.json). يرجى التحقق من صحة عنوان ملف بيان البرنامج المساعد",
    "PluginMarketIndexInvalid": "أنا آسف، فشل التحقق من صحة فهرس البرنامج المساعد. يرجى التحقق من صحة تنسيق ملف الفهرس",
    "PluginMarketIndexNotFound": "أنا آسف، لم يتمكن الخادم من العثور على فهرس البرنامج المساعد. يرجى التحقق من صحة عنوان الفهرس",
    "PluginMetaInvalid": "أنا آسف، فشل التحقق من صحة بيانات التعريف الوصفي للبرنامج المساعد. يرجى التحقق من صحة تنسيق بيانات التعريف الوصفي للبرنامج المساعد",
    "PluginMetaNotFound": "أنا آسف، لم يتم العثور على البرنامج المساعد في الفهرس. يرجى التحقق من معلومات تكوين البرنامج المساعد في الفهرس",
    "PluginOpenApiInitError": "أنا آسف، فشل عميل OpenAPI في البدء. يرجى التحقق من صحة معلومات تكوين OpenAPI.",
    "PluginServerError": "طلب خادم البرنامج المساعد أعاد خطأ. يرجى التحقق من ملف بيان البرنامج المساعد أو تكوين البرنامج المساعد أو تنفيذ الخادم بناءً على معلومات الخطأ أدناه",
    "PluginSettingsInvalid": "يجب تكوين هذا البرنامج المساعد بشكل صحيح قبل استخدامه. يرجى التحقق من صحة التكوين الخاص بك",
    "ProviderBizError": "خطأ في طلب خدمة {{provider}}، يرجى استكشاف الأخطاء وإصلاحها أو إعادة المحاولة بناءً على المعلومات التالية",
    "QuotaLimitReached": "نعتذر، لكن استخدام الرمز المميز الحالي أو عدد الطلبات قد وصل إلى حد الحصة لهذا المفتاح. يرجى زيادة الحصة لهذا المفتاح أو حاول مرة أخرى لاحقًا.",
    "StreamChunkError": "خطأ في تحليل جزء رسالة طلب البث. يرجى التحقق مما إذا كانت واجهة برمجة التطبيقات الحالية متوافقة مع المواصفات القياسية، أو اتصل بمزود واجهة برمجة التطبيقات للحصول على المساعدة.",
    "SubscriptionKeyMismatch": "نعتذر عن الإزعاج. نظرًا لخلل مؤقت في النظام، فإن استخدام اشتراكك الحالي غير نشط. يرجى النقر على الزر أدناه لاستعادة اشتراكك، أو اتصل بنا عبر البريد الإلكتروني للحصول على الدعم.",
    "SubscriptionPlanLimit": "تم استنفاد نقاط اشتراكك، ولا يمكنك استخدام هذه الميزة. يرجى الترقية إلى خطة أعلى أو تكوين واجهة برمجة تطبيقات نموذج مخصصة لمواصلة استخدامها.",
    "SystemTimeNotMatchError": "أنا آسف، وقت نظامك لا يتطابق مع الخادم. يرجى التحقق من وقت نظامك وحاول مرة أخرى.",
    "UnknownChatFetchError": "أنا آسف، حدث خطأ غير معروف في الطلب. يرجى التحقق من المعلومات أدناه أو حاول مرة أخرى."
  },
  "stt": {
    "responseError": "فشل طلب الخدمة، يرجى التحقق من التكوين أو حاول مرة أخرى"
  },
  "tts": {
    "responseError": "فشل طلب الخدمة، يرجى التحقق من التكوين أو حاول مرة أخرى"
  },
  "unlock": {
    "addProxyUrl": "إضافة عنوان وكيل OpenAI (اختياري)",
    "apiKey": {
      "description": "أدخل مفتاح واجهة برمجة التطبيقات {{name}} الخاص بك لبدء الجلسة",
      "title": "استخدام مفتاح واجهة برمجة التطبيقات {{name}} المخصص"
    },
    "closeMessage": "إغلاق الرسالة",
    "confirm": "تأكيد وإعادة المحاولة",
    "oauth": {
      "description": "قام المسؤول بتمكين مصادقة تسجيل الدخول الموحدة. انقر فوق الزر أدناه لتسجيل الدخول وفتح التطبيق.",
      "success": "تسجيل الدخول ناجح",
      "title": "تسجيل الدخول إلى حسابك",
      "welcome": "أهلًا بك!"
    },
    "password": {
      "description": "تم تمكين تشفير التطبيق من قبل المسؤول. أدخل كلمة مرور التطبيق لفتح التطبيق. لا يلزم ملء كلمة المرور إلا مرة واحدة.",
      "placeholder": "يرجى إدخال كلمة المرور",
      "title": "أدخل كلمة المرور لفتح التطبيق"
    },
    "tabs": {
      "apiKey": "مفتاح واجهة برمجة التطبيقات المخصص",
      "password": "كلمة المرور"
    }
  },
  "upload": {
    "desc": "التفاصيل: {{detail}}",
    "fileOnlySupportInServerMode": "وضع النشر الحالي لا يدعم تحميل الملفات غير الصور. لتحميل الملفات بتنسيق {{ext}}، يرجى التبديل إلى نشر قاعدة بيانات الخادم أو استخدام خدمة {{cloud}}.",
    "networkError": "يرجى التحقق من اتصال الشبكة لديك والتأكد من صحة تكوين المنشأ المتقاطع لخدمة تخزين الملفات.",
    "title": "فشل تحميل الملف. يرجى التحقق من اتصال الشبكة لديك أو حاول مرة أخرى لاحقًا",
    "unknownError": "سبب الخطأ: {{reason}}",
    "uploadFailed": "فشل تحميل الملف."
  }
}
