{
  "clerkAuth": {
    "loginSuccess": {
      "action": "Continuer la session",
      "desc": "{{greeting}}, c'est formidable de continuer à vous servir. Reprenons là où nous nous étions arrêtés.",
      "title": "Bienvenue, {{nickName}}"
    }
  },
  "error": {
    "backHome": "Retour à l'accueil",
    "desc": "Réessayez plus tard ou revenez au monde connu.",
    "retry": "Recharger",
    "title": "Oups, quelque chose s'est mal passé..."
  },
  "fetchError": {
    "detail": "Détails de l'erreur",
    "title": "Échec de la requête"
  },
  "import": {
    "importConfigFile": {
      "description": "Motif de l'erreur : {{reason}}",
      "title": "Échec de l'importation"
    },
    "incompatible": {
      "description": "Ce fichier a été exporté à partir d'une version supérieure. Veuillez essayer de passer à la dernière version, puis de le réimporter.",
      "title": "L'application actuelle ne prend pas en charge l'importation de ce fichier"
    }
  },
  "loginRequired": {
    "desc": "Vous allez être redirigé vers la page de connexion sous peu",
    "title": "Veuillez vous connecter pour utiliser cette fonctionnalité"
  },
  "notFound": {
    "backHome": "Retour à l'accueil",
    "check": "Veuillez vérifier si votre URL est correcte.",
    "desc": "Nous n'avons pas trouvé la page que vous recherchiez.",
    "title": "Territoire inconnu ?"
  },
  "pluginSettings": {
    "desc": "Effectuez la configuration suivante pour commencer à utiliser ce plugin",
    "title": "Paramètres du plugin {{name}}"
  },
  "response": {
    "400": "Désolé, le serveur ne comprend pas votre requête. Veuillez vous assurer que les paramètres de votre requête sont corrects.",
    "401": "Désolé, le serveur a rejeté votre requête, probablement en raison d'autorisations insuffisantes ou d'une authentification non valide.",
    "403": "Désolé, le serveur a rejeté votre requête. Vous n'avez pas l'autorisation d'accéder à ce contenu.",
    "404": "Désolé, le serveur ne trouve pas la page ou la ressource que vous avez demandée. Veuillez vous assurer que votre URL est correcte.",
    "405": "Désolé, le serveur ne prend pas en charge la méthode de requête que vous utilisez. Veuillez vous assurer que votre méthode de requête est correcte.",
    "406": "Désolé, le serveur ne peut pas effectuer la requête en fonction des caractéristiques du contenu que vous avez demandé",
    "407": "Désolé, vous devez authentifier le proxy avant de poursuivre cette requête",
    "408": "Désolé, le serveur a expiré en attendant la requête, veuillez vérifier votre connexion réseau et réessayer",
    "409": "Désolé, la requête ne peut pas être traitée en raison d'un conflit, peut-être parce que l'état de la ressource est incompatible avec la requête",
    "410": "Désolé, la ressource que vous avez demandée a été supprimée définitivement et ne peut pas être trouvée",
    "411": "Désolé, le serveur ne peut pas traiter la requête sans une longueur de contenu valide",
    "412": "Désolé, votre requête ne répond pas aux conditions du serveur et ne peut pas être effectuée",
    "413": "Désolé, vos données de requête sont trop volumineuses pour que le serveur puisse les traiter",
    "414": "Désolé, l'URI de votre requête est trop long pour que le serveur puisse le traiter",
    "415": "Désolé, le serveur ne peut pas traiter le format de média joint à la requête",
    "416": "Désolé, le serveur ne peut pas satisfaire la plage de votre requête",
    "417": "Désolé, le serveur ne peut pas répondre à vos attentes",
    "422": "Désolé, votre requête est au format correct, mais en raison d'erreurs sémantiques, elle ne peut pas être traitée",
    "423": "Désolé, la ressource que vous avez demandée est verrouillée",
    "424": "Désolé, la requête actuelle ne peut pas être effectuée en raison d'un échec de requête précédente",
    "426": "Désolé, le serveur exige que votre client passe à une version de protocole supérieure",
    "428": "Désolé, le serveur exige une condition préalable et demande que votre requête contienne l'en-tête conditionnel correct",
    "429": "Désolé, votre requête est trop fréquente et le serveur est un peu fatigué. Veuillez réessayer plus tard.",
    "431": "Désolé, les champs d'en-tête de votre requête sont trop volumineux pour que le serveur puisse les traiter",
    "451": "Désolé, le serveur refuse de fournir cette ressource pour des raisons légales",
    "499": "Nous vous prions de nous excuser, votre requête a été interrompue de manière inattendue lors de son traitement par le serveur, peut-être en raison de votre annulation de l'opération ou d'une connexion réseau instable. Veuillez vérifier l'état de votre réseau et réessayer.",
    "500": "Désolé, le serveur semble rencontrer des difficultés et est temporairement incapable de traiter votre requête. Veuillez réessayer plus tard.",
    "501": "Désolé, le serveur ne sait pas encore comment traiter cette requête. Veuillez confirmer que votre opération est correcte.",
    "502": "Désolé, le serveur semble s'être perdu et est temporairement incapable de fournir un service. Veuillez réessayer plus tard.",
    "503": "Désolé, le serveur est actuellement incapable de traiter votre requête, peut-être en raison d'une surcharge ou d'une maintenance. Veuillez réessayer plus tard.",
    "504": "Désolé, le serveur n'a pas reçu de réponse du serveur en amont. Veuillez réessayer plus tard.",
    "505": "Désolé, le serveur ne prend pas en charge la version HTTP que vous utilisez. Veuillez mettre à jour et réessayer.",
    "506": "Désolé, il y a un problème de configuration avec le serveur. Veuillez contacter l'administrateur pour obtenir une résolution.",
    "507": "Désolé, le serveur n'a pas suffisamment d'espace de stockage pour traiter votre requête. Veuillez réessayer plus tard.",
    "509": "Désolé, la bande passante du serveur a été épuisée. Veuillez réessayer plus tard.",
    "510": "Désolé, le serveur ne prend pas en charge l'extension demandée. Veuillez contacter l'administrateur.",
    "520": "Nous vous prions de nous excuser, le serveur a rencontré un problème inattendu qui l'a empêché de traiter votre requête. Veuillez réessayer plus tard ; nous travaillons à résoudre ce problème.",
    "522": "Nous vous prions de nous excuser, la connexion au serveur a expiré et n'a pas pu répondre à votre requête en temps voulu. Cela peut être dû à un réseau instable ou au serveur qui est temporairement inaccessible. Veuillez réessayer plus tard ; nous travaillons à rétablir le service.",
    "524": "Nous vous prions de nous excuser, le serveur a expiré en attendant une réponse, peut-être en raison d'une réponse lente. Veuillez réessayer plus tard.",
    "FreePlanLimit": "Vous êtes actuellement un utilisateur gratuit et vous ne pouvez pas utiliser cette fonctionnalité. Veuillez passer à un forfait payant pour continuer à l'utiliser.",
    "InsufficientQuota": "Désolé, le quota de cette clé a été atteint. Veuillez vérifier le solde de votre compte ou augmenter le quota de la clé et réessayer.",
    "InvalidAccessCode": "Code d'accès non valide ou vide. Veuillez saisir le code d'accès correct ou ajouter une clé API personnalisée.",
    "InvalidBedrockCredentials": "Échec de l'authentification Bedrock. Veuillez vérifier l'AccessKeyId/SecretAccessKey et réessayer.",
    "InvalidClerkUser": "Désolé, vous n'êtes pas connecté actuellement. Veuillez vous connecter ou créer un compte pour continuer.",
    "InvalidGithubToken": "Le jeton d'accès personnel GitHub est incorrect ou vide. Veuillez vérifier votre jeton d'accès personnel GitHub et réessayer.",
    "QuotaLimitReached": "Nous vous prions de nous excuser, mais l'utilisation actuelle de jetons ou le nombre de requêtes a atteint la limite de quota pour cette clé. Veuillez augmenter le quota de cette clé ou réessayer plus tard.",
    "SubscriptionKeyMismatch": "Nous vous prions de nous excuser pour la gêne occasionnée. En raison d'un dysfonctionnement temporaire du système, votre utilisation actuelle de l'abonnement est inactive. Veuillez cliquer sur le bouton ci-dessous pour restaurer votre abonnement ou nous contacter par e-mail pour obtenir de l'aide.",
    "SubscriptionPlanLimit": "Vos points d'abonnement ont été épuisés et vous ne pouvez pas utiliser cette fonctionnalité. Veuillez passer à un forfait supérieur ou configurer une API de modèle personnalisée pour continuer à l'utiliser.",
    "SystemTimeNotMatchError": "Désolé, l'heure de votre système ne correspond pas à celle du serveur. Veuillez vérifier l'heure de votre système et réessayer.",
    "UnknownChatFetchError": "Désolé, une erreur de requête inconnue s'est produite. Veuillez vérifier les informations ci-dessous ou réessayer."
  },
  "stt": {
    "responseError": "Échec de la requête de service, veuillez vérifier la configuration ou réessayer"
  },
  "tts": {
    "responseError": "Échec de la requête de service, veuillez vérifier la configuration ou réessayer"
  },
  "upload": {
    "desc": "Détails : {{detail}}",
    "fileOnlySupportInServerMode": "Le mode de déploiement actuel ne prend pas en charge le chargement de fichiers autres que des images. Pour charger des fichiers au format {{ext}}, veuillez passer au déploiement de base de données serveur ou utiliser le service {{cloud}}.",
    "networkError": "Veuillez vérifier votre connexion réseau et vous assurer que la configuration d'origine croisée du service de stockage de fichiers est correcte.",
    "title": "Échec du chargement du fichier. Veuillez vérifier votre connexion réseau ou réessayer plus tard",
    "unknownError": "Motif de l'erreur : {{reason}}",
    "uploadFailed": "Échec du chargement du fichier."
  }
}